# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8 object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
ch: 6
nc: 8  # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
   n: [0.33, 0.25, 1024]  # YOLOv8n summary: 225 layers,  3157200 parameters,  3157184 gradients,   8.9 GFLOPs
   s: [0.33, 0.50, 1024]  # YOLOv8s summary: 225 layers, 11166560 parameters, 11166544 gradients,  28.8 GFLOPs
   m: [0.67, 0.75, 768]   # YOLOv8m summary: 295 layers, 25902640 parameters, 25902624 gradients,  79.3 GFLOPs
   l: [1.00, 1.00, 512]   # YOLOv8l summary: 365 layers, 43691520 parameters, 43691504 gradients, 165.7 GFLOPs
   x: [1.00, 1.25, 512]   # YOLOv8x summary: 365 layers, 68229648 parameters, 68229632 gradients, 258.5 GFLOPs

# YOLOv8.0n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, IN, []]  # 0
  - [-1, 1, Multiin, [1]]  # 1
  - [-2, 1, Multiin, [2]]  # 2

  # two stream backbone
  # Visible branch
  - [1, 1, Conv, [64, 3, 2]]  # 3-P1/2
  - [-1, 1, Conv, [128, 3, 2]]  # 4-P2/4
  - [-1, 3, C2f_SC_Block, [128, True]] # 5
  # Infrared branch
  - [2, 1, Conv, [ 64, 3, 2 ] ]  # 6-P1/2
  - [-1, 1, Conv, [ 128, 3, 2 ] ]  # 7-P2/4
  - [-1, 3, C2f_SC_Block, [ 128, True ] ] #8

  - [5, 1, Conv, [256, 3, 2]]  # 9-P3/8-visible
  - [8, 1, Conv, [256, 3, 2]]  # 10-P3/8-infrared


  - [-2, 6, C2f_SC_Block, [256, True]]      # 11-P3/8 visible
  - [-2, 6, C2f_SC_Block, [256, True]]      # 12-P3/8 infrared
  - [-2, 1, Conv, [512, 3, 2]]     # 13-P4/16 visible
  - [-2, 1, Conv, [512, 3, 2]]     # 14-P4/16 infrared


  - [-2, 6, C2f_SC_Block, [512, True]]      # 15-P4/16 visible
  - [-2, 6, C2f_SC_Block, [512, True]]      # 16-P4/16 infrared
  - [-2, 1, Conv, [1024, 3, 2]]     # 17-P5/32 visible
  - [-2, 1, Conv, [1024, 3, 2]]     # 18-P5/32 infrared


  - [-2, 3, C2f_SC_Block, [1024, True]]      # 19-P5/32 visible
  - [-2, 3, C2f_SC_Block, [1024, True]]      # 20-P5/32 infrared
  - [-2, 1, SPPF, [512, 5]]     # 21-P5/32 visible
  - [-2, 1, SPPF, [512, 5]]     # 22-P5/32 infrared

  - [[5, 8], 1, FeatureAdd, [128]] #23
  - [[11, 12], 1, FeatureAdd, [256]]  # 24
  - [[15, 16], 1, FeatureAdd, [512]]  # 25
  - [[21, 22], 1, FeatureAdd, [1024]]  # 26


# YOLOv8.0n head
head:
  - [-1, 1 , GSConv, [512, 1, 1]] #
  - [24, 1 , GSConv, [512, 1, 1]]
  - [[-1, 25, -2], 1, Zoom_cat, []]
  - [-1, 3, VoVGSCSP, [512,True]]  # 30

  - [-1, 1 , GSConv, [256, 1, 1]]
  - [23, 1 , GSConv, [256, 1, 1]]
  - [[-1, 24, -2], 1, Zoom_cat, []] # cat backbone P3
  - [-1, 3, VoVGSCSP, [256,True]]  # 34 (P3/8-small)

  - [-1, 1, GSConv, [256, 3, 2]]
  - [[-1, 31], 1, Concat, [1]]  # cat head P4
  - [-1, 3, VoVGSCSP, [512,True]]  # 37 (P4/16-medium)

  - [-1, 1, GSConv, [512, 3, 2]]
  - [[-1, 27], 1, Concat, [1]]  # cat head P5
  - [-1, 3, VoVGSCSP, [1024,True]]  # 40 (P5/32-large)

  - [[24, 25, 26], 1 ,ScalSeq, [256]]
  - [[34 ,-1],1,Add ,[]]

  - [[42,37,40], 1, Detect, [nc]]  # Detect(P3, P4, P5)
